// חיבור שני מערכים (concat)

let arr1 = [1,2];
let arr2 = [3,4];
let merged = arr1.concat(arr2); // [1,2,3,4]
// חיפוש אינדקס של ערך (indexOf)
numbers = [1,22,34,5,301, 56]
let index = numbers.indexOf(301); // 4

numbers2 = [1,22,34,5, 56]
let index2 = numbers2.indexOf(301); // -1

// בדיקה אם אלמנט קיים (includes)
numbers.includes(40); // true
// היפוך מערך (reverse)
numbers.reverse(); // [5,40,301,1]

//  צור מערך הגרל לתוכו 20 מסםפרים בין 0 ל 100  ו 
//  הדפס אמת אם המספר 70 מופיע במערך אחרת שקר 
//  מצא את מיקומו של 56 אם קיים במידה ולא הדפס מינוס אחד 
// בדוק האם כל המספרים במערך גדולים מ־10.
// צור מערך חדש שמכיל רק את המספרים הזוגיים במערך הקיים.
// החלף בין האיבר הראשון לאיבר האחרון במערך.
// חשב את הממוצע של כל האיברים במערך.
// צור מערך חדש המכיל את ערכי המערך המקורי בסדר הפוך, מבלי לשנות את המקורי.
// מצא את המספר הכי גדול במערך.
// מצא את המספר הכי קטן במערך.








