//1
// צור מערך והגרל לתוכו 15 מספרים בין 1 ל־50.
// הדפס את כמות המספרים הגדולים מ־25.

//2
// צור מערך המכיל 12 מספרים אקראיים בין 10 ל־99.
// הדפס את סכום כל המספרים הזוגיים במערך.

//3
// צור מערך המכיל 20 מספרים אקראיים בין 0 ל־200.
// בדוק אם קיים מספר שמתחלק גם ב־3 וגם ב־5. אם כן, הדפס את מיקומו הראשון; אם לא קיים, הדפס מינוס אחד.

//4
// צור מערך המכיל 10 מספרים אקראיים בין 5 ל־55.
// חשב את סכום האיבר הראשון והאיבר האחרון, והדפס אותו.

//5
// צור מערך המכיל 25 מספרים אקראיים בין 0 ל־300.
// הדפס את כמות המספרים האי־זוגיים במערך.

//6
// צור מערך המכיל 18 מספרים אקראיים בין 1 ל־80.
// החלף את הערך באמצע המערך (האיבר התשיעי) עם הערך הראשון, והדפס את המערך לאחר השינוי.

//7
// צור מערך המכיל 15 מספרים אקראיים בין 1 ל־150.
// בדוק אם לפחות מספר אחד במערך הוא 100, והדפס בהתאם "קיים" או "לא קיים".

//8
// צור מערך המכיל 30 מספרים אקראיים בין 1 ל־500.
// הדפס מערך חדש הכולל רק מספרים שמתחלקים ב־10.

//9
// צור מערך המכיל 10 מספרים אקראיים בין 1 ל־20.
// בדוק והדפס אם יש במערך לפחות שני מספרים זהים.

//10
// צור מערך המכיל 22 מספרים אקראיים בין 10 ל־100.
// הדפס מערך חדש הכולל את כל המספרים מהמערך המקורי שהם גדולים מהממוצע של כל המספרים במערך.







